{
  "plugins": {
    "alabaster.nvim": {
      "src": "https://github.com/p00f/alabaster.nvim",
      "version": "'main'"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'v1.8.0'"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim",
      "version": "'main'"
    },
    "chezmoi.nvim": {
      "src": "https://github.com/xvzc/chezmoi.nvim",
      "version": "'8b426285c2b0acb9b0dd46789193fa97f6480b99'"
    },
    "chezmoi.vim": {
      "src": "https://github.com/alker0/chezmoi.vim",
      "version": "'ca5f2ed602046d5662cb76d845c4b510aae0ce84'"
    },
    "claudecode.nvim": {
      "src": "https://github.com/coder/claudecode.nvim",
      "version": "'main'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'fbcb4fa7f34bfea9be702ffff481a8e336ebf6ed'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'6e3c66548035e50db7bd8e360a29aec6620c3641'"
    },
    "grug-far.nvim": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'ed1f853847ffd04b2b61c314865665e1dadf22c7'"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim",
      "version": "'master'"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim",
      "version": "'e28ce52fc7ff79fcb76f0e79ee6fb6182fca90b9'"
    },
    "leap.nvim": {
      "src": "https://github.com/ggandor/leap.nvim",
      "version": "'7068a0576694efb72798696de65155d503bcb0ef'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'ad7146aa61dcaeb54fa900144d768f040090bff0'"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim"
    },
    "nvim-parinfer": {
      "src": "https://github.com/gpanders/nvim-parinfer",
      "version": "'5ca09287ab3f4144f78ff7977fabc27466f71044'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "oxocarbon.nvim": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim",
      "version": "'main'"
    },
    "persistence.nvim": {
      "src": "https://github.com/folke/persistence.nvim",
      "version": "'166a79a55bfa7a4db3e26fc031b4d92af71d0b51'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd5226c2f76c951fc8ed5923d85e4de065e509'"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim",
      "version": "'v0.10.0'"
    },
    "rainbow_csv.nvim": {
      "src": "https://github.com/cameron-wags/rainbow_csv.nvim",
      "version": "'26de78d8324f7ac6a3e478319d1eb1f17123eb5b'"
    },
    "reactive.nvim": {
      "src": "https://github.com/rasulomaroff/reactive.nvim",
      "version": "'e0a22a42811ca1e7aa7531f931c55619aad68b5d'"
    },
    "sidekick.nvim": {
      "src": "https://github.com/folke/sidekick.nvim",
      "version": "'v2.0.0'"
    },
    "smart-splits.nvim": {
      "src": "https://github.com/mrjones2014/smart-splits.nvim",
      "version": "'v2.0.5'"
    },
    "smear-cursor.nvim": {
      "src": "https://github.com/sphamba/smear-cursor.nvim",
      "version": "'v0.6.0'"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'fe7cfe9800a182274d0f868a74b7263b8c0c020b'"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive",
      "version": "'61b51c09b7c9ce04e821f6cf76ea4f6f903e3cf4'"
    },
    "vim-rhubarb": {
      "src": "https://github.com/tpope/vim-rhubarb",
      "version": "'5496d7c94581c4c9ad7430357449bb57fc59f501'"
    },
    "vim-wakatime": {
      "src": "https://github.com/wakatime/vim-wakatime",
      "version": "'master'"
    }
  }
}